# 01
# 문자열 별로 슬라이스
# for i in range(len(str1))
#   첫번째 글자가 몇 개나 들어있나...
#   두번째 글자가 몇 개나 들어있나...
# 이거 최대값 구해서 리턴하는 방식으로


# 02
# brute force 사용
# 있으면 1
# 없으면 0


# 03 가장 빠른 문자열 타이핑
# brute force 로 B 문자열이 몇 개나 들어있나 계산
# 나머지 문자는 몇 개인지 계산
# 둘이 합산하여 결과 도출


# 04 회문1
# 가로줄 다 join해서 회문 검사
# 세로줄 다 zip하고 join해서 회문 검사


# 회문2
# 가로줄 다 join해서 회문 검사
# 세로줄 다 zip하고 join해서 회문 검사
# 회문들 len값 구해서 최대값 도출


# pycharm으로 과목평가 문제 풀이
# 제출 횟수 제한 없음 swea 제출과 비슷함
# 그 자리에서 바로 pass 결과 나옴
# input 파일 여는 코드
'''
import sys
sys.stdin = open('input.txt')
'''
# 이거 쓸 줄 알아야 함